-- ##############################################################################################
require("prototypes.mining-resource")
require("technology.technology-data-final-fixes")
require("prototypes.energy")
-- ##############################################################################################
-- ПРЕДМЕТЫ
-- ##############################################################################################
require("prototypes.items.item-fix")
-- ##############################################################################################
-- РЕЦЕПТЫ
-- ##############################################################################################
require("prototypes.recipes.recipes-fix")                   -- измененые рецепты
require("prototypes.recipes.recipe-delete")                 -- удаление ненужных рецептов
-- ##############################################################################################
-- НАУКА
-- ##############################################################################################
require("prototypes.technology.science-replace")            -- Замена научных пакетов
-- ##############################################################################################
-- ТЕХНОЛОГИИ
-- ##############################################################################################
require("prototypes.technology.tech-rename")                -- Переименование технологий
require("prototypes.technology.technology-dependency-fix")  -- Изменение зависимостей технологий
-- ##############################################################################################