-- ##############################################################################################
require("prototypes.music.music-data")
require("prototypes.recipes.recipes-data")
require("prototypes.character-settings")
-- ##############################################################################################
-- GROUPS / SUBGROUPS
-- ##############################################################################################
require("prototypes.groups")
-- ##############################################################################################
-- 
-- ##############################################################################################

-- ##############################################################################################
-- ITEMS
-- ##############################################################################################
    -- новые предметы добычи дерева
if settings.startup["CTD-new-tree-recipes"].value then
    require("prototypes.wood")
end

    -- научные анализаторы и исследовательские данные
require("prototypes.scientific-analyzer")

    -- Щебень
require("prototypes.items.crushed-stone")

    -- Технологические карты Krastorio
require("prototypes.Krastorio.kr-tech-cards")
-- ##############################################################################################
-- RECIPES
-- ##############################################################################################

-- ##############################################################################################
-- ENTITIES
-- ##############################################################################################
    -- обломки
require("prototypes.Krastorio.remnants.kr-big-random-pipes-remnants")
require("prototypes.Krastorio.remnants.kr-medium-random-pipes-remnants")

    -- дробилки руды
require("prototypes.buildings.ore-crusher")

    -- теплица Krastorio
require("prototypes.Krastorio.buildings.greenhouse")

    -- Электролизный завод Krastorio
require("prototypes.Krastorio.buildings.electrolysis-plant")
-- ##############################################################################################
-- ##############################################################################################
-- ##############################################################################################