-- ##############################################################################################
        -- GROUPS
-- ##############################################################################################

-- ##############################################################################################
        -- SUBGROUPS
-- ##############################################################################################
data:extend(
    {
        {
			type = "item-subgroup",
			name = "CTD-raw",
			group = "intermediate-products",
			order = "a[CTD-raw]"
		},
        {
			type = "item-subgroup",
			name = "CTD-ore-crusher",
			group = "production",
			order = "a[CTD-ore-crusher]"
		}
    }
)
-- ##############################################################################################
-- Создаем подгруппу для виртуальных сигналов если ее нет
if not data.raw["item-subgroup"]["virtual-signal"] then
    data:extend({
        {
            type = "item-subgroup",
            name = "virtual-signal",
            group = "production",
            order = "zz"
        }
    })
end
-- ##############################################################################################